In [1]:
import pandas as pd

In [2]:
# open file for ML preprocessing
currentStaffData = pd.read_csv('Existing Staff.csv')
exitedStaffData = pd.read_csv('Exited Staff.csv')

In [3]:
# analysis for currentStaffData and exitedStaffData
currentStaffData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   S/N               3500 non-null   int64
 1   Job Title         3500 non-null   object
 2   Department        3500 non-null   object
 3   Age               3500 non-null   int64
 4   Gender            3500 non-null   object
 5   Marital Status    3500 non-null   object
 6   Years of Service  3500 non-null   int64
 7   Salary            3500 non-null   float64
dtypes: float64(1), int64(3), object(4)
memory usage: 218.9+ KB

In [4]:
exitedStaffData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 820 entries, 0 to 819
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Job Title         820 non-null    object
 1   Department        820 non-null    object
 2   Age               820 non-null    int64
 3   Gender            820 non-null    object
 4   Marital Status    820 non-null    object
 5   Years of Service  820 non-null    int64
 6   Mode of Exit      820 non-null    object
 7   Date of Exit      820 non-null    object
 8   Reasons For Exit  820 non-null    object
 9   Salary            820 non-null    float64
dtypes: float64(1), int64(2), object(7)
memory usage: 64.2+ KB

In [7]:
# find and remove duplicates
currentStaffData.duplicated().count().sum()
currentStaffData.drop_duplicates(inplace=True)

In [8]:
exitedStaffData.duplicated().count().sum()
exitedStaffData.drop_duplicates(inplace=True)

In [9]:
currentStaffData.head()

,S/N,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary
0,1,HR Specialist,Human Resources,25,Male,Married,2,537.25
1,2,Project Manager,Sales & Marketing,53,Male,Single,8,154.13
2,3,Billing Specialist,IT & Software,44,Female,Married,8,368.54
3,4,Marketing Analyst,Data Analytics,37,Female,Married,7,269.92
4,5,Product Manager,IT & Software,30,Male,Single,4,131.17

In [10]:
exitedStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Mode of Exit,Date of Exit,Reasons For Exit,Salary
0,Marketing Analyst,Field Operations,31,Female,Single,4,Termination,9/30/2024,Policy violation,338.541667
1,Marketing Analyst,Field Operations,60,Female,Single,6,Retirement,8/21/2023,Work-life balance,357.333333
2,Marketing Analyst,Sales & Marketing,60,Male,Married,5,Retirement,1/11/2024,End of service,594.416667
3,Software Developer,Data Analytics,26,Female,Married,7,Termination,5/2/2023,End of service,439.583333
4,Sales Executive,Project Management,60,Female,Married,2,Retirement,2/14/2024,Policy violation,737.916667

In [11]:
# round salary values to 2 d.p.
exitedStaffData['Salary'] = exitedStaffData['Salary'].round(2)
currentStaffData['Salary'] = currentStaffData['Salary'].round(2)

In [12]:
# find and remove null values
currentStaffData.isna().sum()
currentStaffData.dropna(inplace=True)

In [13]:
exitedStaffData.isna().sum()
exitedStaffData.dropna(inplace=True)

In [14]:
# determine unique values
currentStaffData.nunique()

S/N                 3500
Job Title             12
Department             9
Age                   37
Gender                 2
Marital Status         2
Years of Service       8
Salary              2925
dtype: int64

In [15]:
exitedStaffData.nunique()

Job Title            12
Department            9
Age                  39
Gender                2
Marital Status        2
Years of Service     10
Mode of Exit          3
Date of Exit        497
Reasons For Exit      9
Salary              782
dtype: int64

In [16]:
# deep dive into unique values
currentStaffData['Job Title'].unique()

array(['HR Specialist', 'Project Manager', 'Billing Specialist',
       'Marketing Analyst', 'Product Manager', 'Data Scientist',
       'Customer Support Agent', 'IT Support Engineer', 'Sales Executive',
       'Telecom Technician', 'Network Engineer', 'Software Developer'],
      dtype=object)

In [17]:
exitedStaffData['Job Title'].unique()

array(['Marketing Analyst', 'Software Developer', 'Sales Executive',
       'HR Specialist', 'Network Engineer', 'Telecom Technician',
       'IT Support Engineer', 'Billing Specialist', 'Data Scientist',
       'Customer Support Agent', 'Project Manager', 'Product Manager'],
      dtype=object)

In [18]:
currentStaffData['Department'].unique()

array(['Human Resources', 'Sales & Marketing', 'IT & Software',
       'Data Analytics', 'Network Operations', 'Field Operations',
       'Customer Service', 'Billing', 'Project Management'], dtype=object)

In [19]:
exitedStaffData['Department'].unique()

array(['Field Operations', 'Sales & Marketing', 'Data Analytics',
       'Project Management', 'Customer Service', 'Network Operations',
       'Human Resources', 'Billing', 'IT & Software'], dtype=object)

In [20]:
# Age range
print(f"Age range: {currentStaffData['Age'].min()} - {currentStaffData['Age'].max()}")

Age range: 22 - 58

In [21]:
print(f"Age range: {exitedStaffData['Age'].min()} - {exitedStaffData['Age'].max()}")

Age range: 22 - 60

In [22]:
# Years of service range
print(f"Age range: {currentStaffData['Years of Service'].min()} - {currentStaffData['Years of Service'].max()}")

Age range: 1 - 8

In [23]:
print(f"Age range: {exitedStaffData['Years of Service'].min()} - {exitedStaffData['Years of Service'].max()}")

Age range: 1 - 10

In [24]:
# Mean years of service
currentStaffData['Years of Service'].mean()

np.float64(5.000571428571429)

In [25]:
exitedStaffData['Years of Service'].mean()

np.float64(4.842682926829268)

In [26]:
exitedStaffData['Mode of Exit'].unique()

array(['Termination', 'Retirement', 'Resignation'], dtype=object)

In [27]:
exitedStaffData['Reasons For Exit'].unique()

array(['Policy violation', 'Work-life balance', 'End of service',
       'Performance issues', 'Better opportunity', 'Personal reasons',
       'Restructuring', 'Career growth', 'Pursuing education'],
      dtype=object)

In [28]:
exitedStaffData[exitedStaffData['Reasons For Exit'] == 'Career growth'].shape

(86, 10)

In [29]:
# determine the total number of customers that exited based on the reasons
reasons = exitedStaffData['Reasons For Exit'].unique()

for reason in reasons:
    count = exitedStaffData[exitedStaffData['Reasons For Exit'] == str(reason)].shape[0]
    print(f"{count} workers have '{reason}' as the reason for their exit")

96 workers have 'Policy violation' as the reason for their exit
90 workers have 'Work-life balance' as the reason for their exit
94 workers have 'End of service' as the reason for their exit
85 workers have 'Performance issues' as the reason for their exit
105 workers have 'Better opportunity' as the reason for their exit
84 workers have 'Personal reasons' as the reason for their exit
100 workers have 'Restructuring' as the reason for their exit
86 workers have 'Career growth' as the reason for their exit
80 workers have 'Pursuing education' as the reason for their exit

In [30]:
modes = exitedStaffData['Mode of Exit'].unique()

for mode in modes:
    count = exitedStaffData[exitedStaffData['Mode of Exit'] == str(mode)].shape[0]
    print(f"{count} workers have '{mode}' as their mode of exit")

261 workers have 'Termination' as their mode of exit
263 workers have 'Retirement' as their mode of exit
296 workers have 'Resignation' as their mode of exit

In [31]:
# remove unneeded columns in currentStaffData and exitedStaffData
currentStaffData.drop(columns=['S/N'], inplace=True)
exitedStaffData.drop(columns=['Date of Exit'], inplace=True)

In [32]:
# view new datasets
currentStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary
0,HR Specialist,Human Resources,25,Male,Married,2,537.25
1,Project Manager,Sales & Marketing,53,Male,Single,8,154.13
2,Billing Specialist,IT & Software,44,Female,Married,8,368.54
3,Marketing Analyst,Data Analytics,37,Female,Married,7,269.92
4,Product Manager,IT & Software,30,Male,Single,4,131.17

In [33]:
exitedStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Mode of Exit,Reasons For Exit,Salary
0,Marketing Analyst,Field Operations,31,Female,Single,4,Termination,Policy violation,338.54
1,Marketing Analyst,Field Operations,60,Female,Single,6,Retirement,Work-life balance,357.33
2,Marketing Analyst,Sales & Marketing,60,Male,Married,5,Retirement,End of service,594.42
3,Software Developer,Data Analytics,26,Female,Married,7,Termination,End of service,439.58
4,Sales Executive,Project Management,60,Female,Married,2,Retirement,Policy violation,737.92

In [34]:
# current dataset is inbalanced (i.e more positives than negatives)
print(f'currentStaffData size: {currentStaffData.shape[0]} exitedStaffData size: {exitedStaffData.shape[0]}')

currentStaffData size: 3500 exitedStaffData size: 820

In [35]:
# remove more unwanted columns in exitedStaffData
# its needed for the modelling stage
exitedStaffData.drop(columns=['Mode of Exit', 'Reasons For Exit'], inplace=True)

In [36]:
exitedStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary
0,Marketing Analyst,Field Operations,31,Female,Single,4,338.54
1,Marketing Analyst,Field Operations,60,Female,Single,6,357.33
2,Marketing Analyst,Sales & Marketing,60,Male,Married,5,594.42
3,Software Developer,Data Analytics,26,Female,Married,7,439.58
4,Sales Executive,Project Management,60,Female,Married,2,737.92

In [37]:
# append a new column for model prediction
# should be straight forward since we have two datasets of two unique different classes
# i.e. current workers and exited workers
currentStaffData['Exited'] = 0
exitedStaffData['Exited'] = 1

In [38]:
currentStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary,Exited
0,HR Specialist,Human Resources,25,Male,Married,2,537.25,0
1,Project Manager,Sales & Marketing,53,Male,Single,8,154.13,0
2,Billing Specialist,IT & Software,44,Female,Married,8,368.54,0
3,Marketing Analyst,Data Analytics,37,Female,Married,7,269.92,0
4,Product Manager,IT & Software,30,Male,Single,4,131.17,0

In [39]:
exitedStaffData.head()

,Job Title,Department,Age,Gender,Marital Status,Years of Service,Salary,Exited
0,Marketing Analyst,Field Operations,31,Female,Single,4,338.54,1
1,Marketing Analyst,Field Operations,60,Female,Single,6,357.33,1
2,Marketing Analyst,Sales & Marketing,60,Male,Married,5,594.42,1
3,Software Developer,Data Analytics,26,Female,Married,7,439.58,1
4,Sales Executive,Project Management,60,Female,Married,2,737.92,1

In [40]:
# combine both currentStaffData and exitedStaffData as one
dataset = pd.concat([currentStaffData, exitedStaffData])

In [ ]:
dataset.shape

(4320, 8)

In [ ]:
# save combined dataset
dataset.to_csv('Dataset.csv')